---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ModificationForbiddenException
source: html/6d698a9c-aa49-0f4f-d389-b349e240c7c3.htm
---
# ModificationForbiddenException Methods

Retrieves data needed to serialize the target object.